Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F20C.tmx
Source language: en_us
Languages: zh_cn

source: Facing the Enemies Within
zh_cn: 敢于面对内心的敌人

source: We are not born with courage, but neither are we born with fear.
zh_cn: 我们与生俱来并不拥有勇气和害怕。

source: Maybe some of our fears are brought on by your own experiences, by what someone has told you, by what you've read in the papers.
zh_cn: 我们的害怕可能来源于我们的成长经历，他人的诉说，或者是从我们阅读的信息中获得的。

source: Some fears are valid, like walking alone in a bad part of town at two o'clock in the morning.
zh_cn: 有些害怕是有效的，例如当你在凌晨2点独自一人在环境糟透的小镇行走。

source: But once you learn to avoid that situation, you won't need to live in fear of it.
zh_cn: 但是你一旦掌握了如何避免这种情况，你就不会惶恐的生活了。

source: Fears, even the most basic ones, can totally destroy our ambitions.
zh_cn: 害怕，最基本的情绪，将会完全的摧毁我们的梦想。

source: Fear can destroy fortunes.
zh_cn: 害怕将会使我们错失好的机遇。

source: Fear can destroy relationships.
zh_cn: 害怕将会破坏我们与他人的关系。

source: Fear, if left unchecked, can destroy our lives.
zh_cn: 害怕，如果一直存在，将会毁坏我们的生活。

source: Fear is one of the many enemies lurking inside us.
zh_cn: 害怕是我们内心潜藏的敌人之一。

source: Let me tell you about five of the other enemies we face from within.
zh_cn: 接下来阐述的是我们内心存在的5大敌人。

source: The first enemy that you've got to destroy before it destroys you is indifference.
zh_cn: 我们需要在被摧毁之前先摧毁的首要敌人便是无知。

source: What a tragic disease this is.
zh_cn: 真是悲剧啊！

source: "Ho-hum, let it slide. I'll just drift along."
zh_cn: “哦，不用管它，我会继续前行”。

source: Here's one problem with drifting: you can't drift your way to the top of the mountain.
zh_cn: 这将是前行中遇到的问题之一：那就是你不会到达山顶。（你将永远不会成功！）

source: The second enemy we face is indecision.
zh_cn: 我们面临的第二大敌人便是犹豫不决。

source: Indecision is the thief of opportunity and enterprise.
zh_cn: 犹豫不决将会使我们错失好的机遇和公司。

source: It will steal your chances for a better future.
zh_cn: 犹豫不决将会使我们错失获得更好生活的机会。

source: Take a sword to this enemy.
zh_cn: 灭掉这个敌人。

source: The third enemy inside is doubt.
zh_cn: 第三大敌人便是怀疑。

source: Sure, there's room for healthy skepticism.
zh_cn: 当然，怀疑也是有好处的。

source: You can't believe everything.
zh_cn: 你不可能相信所有事情。

source: But you also can't let doubt take over.
zh_cn: 但是你不能让怀疑控制你的人生。

source: Many people doubt the past, doubt the future, doubt each other, doubt the government, doubt the possibilities and doubt the opportunities.
zh_cn: 很多人怀疑过去，怀疑未来，怀疑他人，怀疑政府，怀疑成功的可能性，怀疑机会。

source: Worse of all, they doubt themselves.
zh_cn: 最可悲的是，他们会怀疑他们自己。

source: I'm telling you, doubt will destroy your life and your chances of success.
zh_cn: 我来告诉你，怀疑将会毁灭你的人生，以及错失通往成功的机会。

source: It will empty both your bank account and your heart.
zh_cn: 怀疑将会使你遭受物质和灵魂双重打击。

source: Doubt is an enemy. Go after it. Get rid of it.
zh_cn: 怀疑是我们的敌人，所以抓住它，消灭它。

source: The fourth enemy within is worry.
zh_cn: 我们内心的第四大敌人便是焦虑。

source: We've all got to worry some. Just don't let it conquer you.
zh_cn: 我们所有人都会焦虑，但是不要让焦虑一直影响你。

source: Instead, let it alarm you.
zh_cn: 相反，我们应该让焦虑成为我们的警钟，在关键时刻提醒我们。

source: Worry can be useful.
zh_cn: 焦虑是有用的。

source: If you step off the curb in New York City and a taxi is coming, you've got to worry.
zh_cn: 当你走在纽约市的人行横道上，这时刚好有一辆出租车正在向你驶来，你会变得十分焦虑。

source: But you can't let worry loose like a mad dog that drives you into a small corner.
zh_cn: 但是你不能让焦虑自由发展，像疯狗一样把你驱逐到一个小角落。

source: Here's what you've got to do with your worries: drive them into a small corner.
zh_cn: 你需要把焦虑放在内心的一小角。

source: Whatever is out to get you, you've got to get it.
zh_cn: 尽其所能得到自己想要的。

source: Whatever is pushing on you, you've got to push back.
zh_cn: 不管面临什么困难，你都需要绝地反击。

source: The fifth interior enemy is over-caution.
zh_cn: 内心第五大敌人便是过分谨慎。

source: It is the timid approach to life.
zh_cn: 过分谨慎的人生活也是很胆小谨慎的。

source: Timidity is not a virtue; it's an illness.
zh_cn: 胆小不是一种美德而是一种病。
